src/cf/Documents/уатАвансовыйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатАвансовыйОтчет</Name>
			<BasedOn>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.уатПрочиеДоходыРасходы</xr:Item>
				<xr:Item>Document.уатПутевойЛист</xr:Item>
				<xr:Item>Document.уатРасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.уатПлатежноеПоручениеИсходящее</xr:Item>
				<xr:Item>Document.уатРемонтныйЛист</xr:Item>
				<xr:Item>Document.уатЗаправкаГСМ</xr:Item>
				<xr:Item>Document.уатКомандировкиОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатОстаткиДСУПодотчетныхЛиц</xr:Item>
				<xr:Item>AccumulationRegister.уатТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
				<xr:Item>InformationRegister.уатДатыДвиженияТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мультивалютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.уатКомандировкиОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПрочиеДоходыРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаправкаГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеАванса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтражения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасхода</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.уатКомандировкиОрганизаций</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПрочиеДоходыРасходы</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаправкаГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВДокументеРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВключаетНДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьНДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по работе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/уатВидыЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыЗатрат</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Амортизация</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЖ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаРасходныхМатериалов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеАгрегатов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеМатериаловНаПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатСпособыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСпособыРемонта</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автосервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемЗона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатАвансовыйОтчет/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	Документы.уатАвансовыйОтчет.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	уатПроведение_проф.ОтразитьОстаткиДСУПодотчетныхЛиц(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение.ОтразитьРасходы(ДополнительныеСвойства, Движения, Отказ);
	
	уатПроведение.ОтразитьПартииТоваровНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	Если ПолучитьФункциональнуюОпцию("уатАдресноеХранение") = ИСТИНА И Склад.АдресноеХранение Тогда
		уатПроведение_проф.ОтразитьТоварыВЯчейках(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	уатПроведение_проф.ОтразитьДатыДвиженияТоваровНаСкладах(ДополнительныеСвойства, Движения, Отказ);
		
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Документы.уатАвансовыйОтчет.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	уатУчетОригиналовПервичныхДокументов.СформироватьДвиженияРеестрДокументов(Ссылка);
	
КонецПроцедуры // ОбработкаПроведения

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.уатАвансовыйОтчет.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
    уатОбщегоНазначенияТиповые.ЗаполнитьШапкуДокумента(ЭтотОбъект, ПользователиКлиентСервер.АвторизованныйПользователь());
	
	ТекДата = ТекущаяДата();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатРасходныйКассовыйОрдер")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПлатежноеПоручениеИсходящее") Тогда
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ПодотчетноеЛицо = ДанныеЗаполнения.ПодотчетноеЛицо;
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
				
		тблРасходы = ДанныеЗаполнения.РасшифровкаПлатежа.Выгрузить();
		тблРасходы.Свернуть("СтавкаНДС", "СуммаПлатежа, СуммаНДС");
		Для Каждого ТекСтрока Из тблРасходы Цикл
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.ДатаОтражения = ТекДата;
			НоваяСтрока.ДокументРасхода = ДанныеЗаполнения;
			НоваяСтрока.СтатьяРасходов = Справочники.уатСтатьиРасходов.ОсновнаяСтатьяРасходов;
			НоваяСтрока.СуммаВДокументеРасхода = ТекСтрока.СуммаПлатежа;
			НоваяСтрока.Сумма = ТекСтрока.СуммаПлатежа;
			
			НоваяСтрока.УчитыватьНДС = Истина;
			НоваяСтрока.СуммаВключаетНДС = Истина;
			НоваяСтрока.СуммаНДС = ТекСтрока.СуммаНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатКомандировкиОрганизаций") Тогда
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		
		Если ДанныеЗаполнения.РаботникиОрганизации.Количество() > 0 Тогда
			ПодотчетноеЛицо = ДанныеЗаполнения.РаботникиОрганизации[0].Сотрудник.ФизическоеЛицо;
			
			тблРасходы = ДанныеЗаполнения.РаботникиОрганизации.Выгрузить();
			Сч = тблРасходы.Количество()-1;
			Пока Сч >= 0 Цикл
				Если тблРасходы[Сч].Сотрудник.ФизическоеЛицо <> ПодотчетноеЛицо Тогда
					тблРасходы.Удалить(Сч);
				КонецЕсли;
				
				Сч = Сч - 1;
			КонецЦикла;
						
			ТекСуммаПлатежа = тблРасходы.Итог("Сумма");
			Если ТекСуммаПлатежа > 0 Тогда
				НоваяСтрока = Расходы.Добавить();
				НоваяСтрока.ДатаОтражения = ТекДата;
				НоваяСтрока.ДокументРасхода = ДанныеЗаполнения;
				НоваяСтрока.СтатьяРасходов = Справочники.уатСтатьиРасходов.ОсновнаяСтатьяРасходов;
				НоваяСтрока.СуммаВДокументеРасхода = ТекСуммаПлатежа;
				НоваяСтрока.Сумма = ТекСуммаПлатежа;
				
				НоваяСтрока.УчитыватьНДС = Истина;
				НоваяСтрока.СуммаВключаетНДС = Истина;
				НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			КонецЕсли;
		КонецЕсли;
								
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПрочиеДоходыРасходы") Тогда
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		
		тблРасходы = ДанныеЗаполнения.Расходы.Выгрузить();
		тблРасходы.Свернуть("СтатьяРасходов, ТС, СтавкаНДС", "Сумма, СуммаНДС");
		Для Каждого ТекСтрока Из тблРасходы Цикл
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.ДатаОтражения = ТекДата;
			НоваяСтрока.ДокументРасхода = ДанныеЗаполнения;
			НоваяСтрока.СтатьяРасходов = ТекСтрока.СтатьяРасходов;
			НоваяСтрока.СуммаВДокументеРасхода = ТекСтрока.Сумма;
			НоваяСтрока.Сумма = ТекСтрока.Сумма;
			НоваяСтрока.ТС = ТекСтрока.ТС;
			
			НоваяСтрока.УчитыватьНДС = ДанныеЗаполнения.УчитыватьНДС;
			НоваяСтрока.СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
			НоваяСтрока.СуммаНДС = ТекСтрока.СуммаНДС;
		КонецЦикла;
						
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		
		тблЗаправкиГСМ = уатОбщегоНазначения.уатПолучитьЗаправкиДляПЛ(ДанныеЗаполнения);
		СтатьяРасходовГСМ = уатОбщегоНазначения.НайтиСтатьюЗатрат(ДанныеЗаполнения.ПланЗатрат, Перечисления.уатВидыЗатрат.ГСМ);
		Если НЕ ЗначениеЗаполнено(СтатьяРасходовГСМ) Тогда
			СтатьяРасходовГСМ = Справочники.уатСтатьиРасходов.ОсновнаяСтатьяРасходов;
		КонецЕсли;
		
		Если тблЗаправкиГСМ.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(тблЗаправкиГСМ[0].Водитель) Тогда
				ПодотчетноеЛицо = тблЗаправкиГСМ[0].Водитель.ФизическоеЛицо
			КонецЕсли;
		ИначеЕсли ДанныеЗаполнения.ПрочиеРасходы.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(ДанныеЗаполнения.Водитель1) Тогда
				ПодотчетноеЛицо = ДанныеЗаполнения.Водитель1.ФизическоеЛицо;
			КонецЕсли;
		КонецЕсли;
		
		тблРасходы = ДанныеЗаполнения.ПрочиеРасходы.Выгрузить(); // Прочие расходы
		Для Каждого ТекСтрока Из тблЗаправкиГСМ Цикл // Проведенные заправки за наличные
			Если ТекСтрока.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаНаличные И ТекСтрока.Картинка = 1 Тогда
				НоваяСтрока = тблРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.СтатьяРасходов = СтатьяРасходовГСМ;
			КонецЕсли;
		КонецЦикла;
		тблРасходы.Свернуть("СтатьяРасходов, Валюта, СтавкаНДС, УчитыватьНДС, СуммаВключаетНДС", "Сумма, СуммаНДС");
				
		тблВалюты = тблРасходы.Скопировать();
		тблВалюты.Свернуть("Валюта");
		Если тблВалюты.Количество() = 1 Тогда //одновалютный
			Если тблЗаправкиГСМ.Количество() > 0 Тогда
				ВалютаДокумента = тблЗаправкиГСМ[0].Валюта;
			ИначеЕсли ДанныеЗаполнения.ПрочиеРасходы.Количество() > 0 Тогда
				ВалютаДокумента = ДанныеЗаполнения.ПрочиеРасходы[0].Валюта;
			КонецЕсли;
			
		Иначе //мультивалютный
			ВалютаДокумента = Неопределено;
			Мультивалютный = Истина;
			
		КонецЕсли;
		
		Для Каждого ТекСтрока Из тблРасходы Цикл
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.ДатаОтражения = ТекДата;
			НоваяСтрока.ДокументРасхода = ДанныеЗаполнения;
			НоваяСтрока.СтатьяРасходов = 
				?(ЗначениеЗаполнено(ТекСтрока.СтатьяРасходов), ТекСтрока.СтатьяРасходов, Справочники.уатСтатьиРасходов.ОсновнаяСтатьяРасходов);
			
			Если Мультивалютный Тогда
				НоваяСтрока.СуммаВДокументеРасхода = ТекСтрока.Сумма;
				НоваяСтрока.Валюта = ТекСтрока.Валюта;
			Иначе
				НоваяСтрока.СуммаВДокументеРасхода = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
					ТекСтрока.Валюта, ВалютаДокумента, НоваяСтрока.ДатаОтражения, НоваяСтрока.ДатаОтражения,,,,
					ЭтотОбъект);
			КонецЕсли;
				
			НоваяСтрока.Сумма = НоваяСтрока.СуммаВДокументеРасхода;
			НоваяСтрока.ТС = ДанныеЗаполнения.ТранспортноеСредство;
			НоваяСтрока.Контрагент = ДанныеЗаполнения.Контрагент;
			
			НоваяСтрока.УчитыватьНДС = ТекСтрока.УчитыватьНДС;
			НоваяСтрока.СуммаВключаетНДС = ТекСтрока.СуммаВключаетНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
			НоваяСтрока.СуммаНДС = ТекСтрока.СуммаНДС;
		КонецЦикла;
								
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатРемонтныйЛист") Тогда
		Если ДанныеЗаполнения.СпособРемонта = Перечисления.уатСпособыРемонта.Автосервис
			И ДанныеЗаполнения.ОплатаПодотчетнымЛицом Тогда
			
			Основание = ДанныеЗаполнения;
			Организация = ДанныеЗаполнения.Организация;
			Подразделение = ДанныеЗаполнения.Подразделение;
			ПодотчетноеЛицо = ДанныеЗаполнения.ПодотчетноеЛицо;
			ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
			
			тблРасходы = ДанныеЗаполнения.Работы.Выгрузить();
			Для Каждого ТекСтрока Из ДанныеЗаполнения.Материалы Цикл
				НоваяСтрока = тблРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЦикла;
			тблРасходы.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			
			Для Каждого ТекСтрока Из тблРасходы Цикл
				НоваяСтрока = Расходы.Добавить();
				НоваяСтрока.ДатаОтражения = ТекДата;
				НоваяСтрока.ДокументРасхода = ДанныеЗаполнения;
				НоваяСтрока.СтатьяРасходов = Справочники.уатСтатьиРасходов.ОсновнаяСтатьяРасходов;
				НоваяСтрока.СуммаВДокументеРасхода = ТекСтрока.Сумма;
				НоваяСтрока.Сумма = НоваяСтрока.СуммаВДокументеРасхода;
				НоваяСтрока.ТС = ДанныеЗаполнения.ТС;
				НоваяСтрока.Контрагент = ДанныеЗаполнения.Контрагент;
				
				НоваяСтрока.УчитыватьНДС = ДанныеЗаполнения.УчитыватьНДС;
				НоваяСтрока.СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
				НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
				НоваяСтрока.СуммаНДС = ТекСтрока.СуммаНДС;
			КонецЦикла;
		Иначе
			Основание = ДанныеЗаполнения;
			Организация     = ДанныеЗаполнения.Организация;
			Подразделение   = ДанныеЗаполнения.Подразделение;
			ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг")
		И ДанныеЗаполнения.ОплатаПодотчетнымЛицом Тогда
		
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ПодотчетноеЛицо = ДанныеЗаполнения.ПодотчетноеЛицо;
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		
		тблРасходы = ДанныеЗаполнения.Товары.Выгрузить();
		Для Каждого ТекСтрока Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = тблРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		тблРасходы.Свернуть("СтатьяРасходов, СтавкаНДС", "Сумма, СуммаНДС");
		
		Для Каждого ТекСтрока Из тблРасходы Цикл
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.ДатаОтражения = ТекДата;
			НоваяСтрока.ДокументРасхода = ДанныеЗаполнения;
			НоваяСтрока.СтатьяРасходов = ТекСтрока.СтатьяРасходов;
			НоваяСтрока.СуммаВДокументеРасхода = ТекСтрока.Сумма;
			НоваяСтрока.Сумма = ТекСтрока.Сумма;
			НоваяСтрока.Контрагент = ДанныеЗаполнения.Контрагент;
			
			НоваяСтрока.УчитыватьНДС = ДанныеЗаполнения.УчитыватьНДС;
			НоваяСтрока.СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
			НоваяСтрока.СуммаНДС = ТекСтрока.СуммаНДС;
		КонецЦикла;
						
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатЗаправкаГСМ")
		И ДанныеЗаполнения.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаНаличные Тогда
		
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.ПодразделениеОрганизации;
		
		тблРасходы = ДанныеЗаполнения.Заправки.Выгрузить();
		тблРасходы.Свернуть("ТС, Водитель, Валюта, СтавкаНДС", "Сумма, СуммаНДС");
		
		тблВалюты = тблРасходы.Скопировать();
		тблВалюты.Свернуть("Валюта");
		Если тблВалюты.Количество() = 1 Тогда //одновалютный
			ВалютаДокумента = тблВалюты[0].Валюта;
			
		Иначе //мультивалютный
			ВалютаДокумента = Неопределено;
			Мультивалютный = Истина;
			
		КонецЕсли;
		
		Для Каждого ТекСтрока Из тблРасходы Цикл
			Если Не ЗначениеЗаполнено(ВалютаДокумента) Тогда
				ВалютаДокумента = ТекСтрока.Валюта;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ПодотчетноеЛицо) Тогда
				ПодотчетноеЛицо = ТекСтрока.Водитель.ФизическоеЛицо;
			КонецЕсли;
			НоваяСтрока = Расходы.Добавить();
			НоваяСтрока.ДатаОтражения = ТекДата;
			НоваяСтрока.ДокументРасхода = ДанныеЗаполнения;
			НоваяСтрока.СтатьяРасходов = Справочники.уатСтатьиРасходов.ОсновнаяСтатьяРасходов;
			
			Если Мультивалютный Тогда
				НоваяСтрока.СуммаВДокументеРасхода = ТекСтрока.Сумма;
				НоваяСтрока.Валюта = ТекСтрока.Валюта;
			Иначе
				НоваяСтрока.СуммаВДокументеРасхода = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
					ТекСтрока.Валюта, ВалютаДокумента, НоваяСтрока.ДатаОтражения, НоваяСтрока.ДатаОтражения,,,,
					ЭтотОбъект);
			КонецЕсли;
				
			НоваяСтрока.Сумма = НоваяСтрока.СуммаВДокументеРасхода;
			НоваяСтрока.ТС = ТекСтрока.ТС;
			НоваяСтрока.Контрагент = ДанныеЗаполнения.АЗС.Контрагент_Склад;
			
			НоваяСтрока.УчитыватьНДС = ДанныеЗаполнения.УчитыватьНДС;
			НоваяСтрока.СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
			НоваяСтрока.СуммаНДС = ТекСтрока.СуммаНДС;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Материалы") Тогда
			Для Каждого ТекСтрока Из ДанныеЗаполнения.Материалы Цикл
				НоваяСтрока = Материалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// курс и кратность
	Если Мультивалютный Тогда
		Для Каждого ТекСтрока Из Расходы Цикл
			СтруктураКурс = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ТекСтрока.Валюта, ТекДата, ЭтотОбъект);
			ТекСтрока.Курс      = СтруктураКурс.Курс;
			ТекСтрока.Кратность = СтруктураКурс.Кратность;
		КонецЦикла;
	Иначе
		СтруктураКурс = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, ТекДата, ЭтотОбъект);
		Курс      = СтруктураКурс.Курс;
		Кратность = СтруктураКурс.Кратность;
	КонецЕсли;
	
	// расчет суммы документа
	РасчитатьСуммуДокумента();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// пересчет суммы документа
	РасчитатьСуммуДокумента();
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И (Курс = 0 ИЛИ Кратность = 0) Тогда
		КурсКратностьДокумента = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, Дата, ЭтотОбъект);
		Курс      = КурсКратностьДокумента.Курс;
		Кратность = КурсКратностьДокумента.Кратность;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	Если Мультивалютный Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВалютаДокумента"));
	Иначе
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Расходы.Валюта"));
	КонецЕсли;
	
	Если Материалы.Количество() > 0 Тогда
		ПроверяемыеРеквизиты.Добавить("Склад");
	КонецЕсли;
	
	Если УчитыватьНДС Тогда
		ПроверяемыеРеквизиты.Добавить("Материалы.СтавкаНДС");
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Расходы Цикл
		Если СтрокаТаблицы.УчитыватьНДС И Не ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда 
			ТекстНСТР = НСтр("en='At line №%1 of tabular section ""Expenses"" is not indicated VAT rate!';ru='В строке №%1 табличной части ""Расходы"" не указана ставка НДС!'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, СтрокаТаблицы.НомерСтроки);
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РасчитатьСуммуДокумента()
	
	СуммаДокумента = 0;
	Для Каждого ТекСтрока Из Расходы Цикл
		ТекСумма = ТекСтрока.Сумма;
		Если ТекСтрока.УчитыватьНДС И НЕ ТекСтрока.СуммаВключаетНДС Тогда
			ТекСумма = ТекСумма + ТекСтрока.СуммаНДС;
		КонецЕсли;
		Если Мультивалютный Тогда
			ТекСумма = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСумма,
				ТекСтрока.Валюта, ВалютаДокумента, ТекСтрока.ДатаОтражения, ТекСтрока.ДатаОтражения,,,,
				ЭтотОбъект);
		КонецЕсли;
		СуммаДокумента = СуммаДокумента + ТекСумма;
	КонецЦикла;
	Для Каждого ТекСтрока Из Материалы Цикл
		СуммаДокумента = СуммаДокумента + ТекСтрока.Сумма
			+ ?(УчитыватьНДС И НЕ СуммаВключаетНДС, ТекСтрока.СуммаНДС, 0);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
